Valknut/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters   0.001;

vertices
(
    (0 0 0)
    (1 0 0.1)
    (1.1 1 0.1)
    (0 1 0.1)
    (-0.1 -0.1 1)
    (1.3 0 1.2)
    (1.4 1.1 1.3)
    (0 1 1.1)
);

edges
(
    arc 1 5 (1.1 0.0 0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (10 10 10)
    simpleGrading (1 2 3)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (0 3 2 1)
            (3 7 6 2)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
