Valknut/0/U
//First Test For Senior Experience

//-----------------------------------------------
//Formating

FoamFile
{
  version   2.0;
  format    ascii;
  class     volVectorField;
  object    U;
}

//-----------------------------------------------

dimensions        [0 1 -1 0 0 0 0];

internalField     uniform (1 0 0);

boundaryField
{
    inlet
    {
        type          fixedValue;
        value         uniform (2 0 0);
    }

    outlet
    {
        type          zeroGradient;
    }

    walls
    {
        type          zeroGradient;
    }
}

//-----------------------------------------------
